In [1]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, StandardScaler
from sklearn.compose import ColumnTransformer
from sklearn.model_selection import train_test_split

In [2]:
df1 = pd.read_csv(r'02_Cleaned_File(Outliers).csv')

In [3]:
df1.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,EstimatedSalary,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited
0,15634602,Hargrave,619,France,Female,42,101348.88,0.00,1,Yes,2,Yes,1
1,15647311,Hill,608,Spain,Female,41,112542.58,83807.86,1,Yes,1,Yes,0
2,15619304,Onio,502,France,Female,42,113931.57,159660.80,3,No,8,No,1
3,15701354,Boni,699,France,Female,39,93826.63,0.00,2,No,1,No,0
4,15737888,Mitchell,850,Spain,Female,43,79084.10,125510.82,1,Yes,2,Yes,0

In [4]:
df1 = pd.get_dummies(df1, columns = ['Geography'], drop_first = True, dtype = 'int')

In [5]:
df1.head()

,CustomerId,Surname,CreditScore,Gender,Age,EstimatedSalary,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited,Geography_Germany,Geography_Spain
0,15634602,Hargrave,619,Female,42,101348.88,0.00,1,Yes,2,Yes,1,0,0
1,15647311,Hill,608,Female,41,112542.58,83807.86,1,Yes,1,Yes,0,0,1
2,15619304,Onio,502,Female,42,113931.57,159660.80,3,No,8,No,1,0,0
3,15701354,Boni,699,Female,39,93826.63,0.00,2,No,1,No,0,0,0
4,15737888,Mitchell,850,Female,43,79084.10,125510.82,1,Yes,2,Yes,0,0,1

In [6]:
# ct = ColumnTransformer(transformers = [('encoder_geography', OneHotEncoder(drop = 'first'), [3])],
#                       remainder = 'passthrough')
# Drop = 'First', to avoid the dummy variable trap (To get rid of Multicollinearity)
# df1 = ct.fit_transform(df1)

In [7]:
le = LabelEncoder()
df1['Gender'] = le.fit_transform(df1['Gender'])
df1.head()

,CustomerId,Surname,CreditScore,Gender,Age,EstimatedSalary,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited,Geography_Germany,Geography_Spain
0,15634602,Hargrave,619,0,42,101348.88,0.00,1,Yes,2,Yes,1,0,0
1,15647311,Hill,608,0,41,112542.58,83807.86,1,Yes,1,Yes,0,0,1
2,15619304,Onio,502,0,42,113931.57,159660.80,3,No,8,No,1,0,0
3,15701354,Boni,699,0,39,93826.63,0.00,2,No,1,No,0,0,0
4,15737888,Mitchell,850,0,43,79084.10,125510.82,1,Yes,2,Yes,0,0,1

In [8]:
df1['HasCrCard'] = le.fit_transform(df1['HasCrCard'])
df1.head()

,CustomerId,Surname,CreditScore,Gender,Age,EstimatedSalary,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited,Geography_Germany,Geography_Spain
0,15634602,Hargrave,619,0,42,101348.88,0.00,1,1,2,Yes,1,0,0
1,15647311,Hill,608,0,41,112542.58,83807.86,1,1,1,Yes,0,0,1
2,15619304,Onio,502,0,42,113931.57,159660.80,3,0,8,No,1,0,0
3,15701354,Boni,699,0,39,93826.63,0.00,2,0,1,No,0,0,0
4,15737888,Mitchell,850,0,43,79084.10,125510.82,1,1,2,Yes,0,0,1

In [9]:
df1['IsActiveMember'] = le.fit_transform(df1['IsActiveMember'])
df1.head()

,CustomerId,Surname,CreditScore,Gender,Age,EstimatedSalary,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited,Geography_Germany,Geography_Spain
0,15634602,Hargrave,619,0,42,101348.88,0.00,1,1,2,1,1,0,0
1,15647311,Hill,608,0,41,112542.58,83807.86,1,1,1,1,0,0,1
2,15619304,Onio,502,0,42,113931.57,159660.80,3,0,8,0,1,0,0
3,15701354,Boni,699,0,39,93826.63,0.00,2,0,1,0,0,0,0
4,15737888,Mitchell,850,0,43,79084.10,125510.82,1,1,2,1,0,0,1

In [10]:
df1.to_csv('03_Cleaned_File(Data Preprocessing).csv', index = False)